perf/long.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node/ping'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

    node_intensive:
      target: 'http://localhost:5555/node/intensive?number=10'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"      

    bbox_1:
      target: 'http://localhost:5555/bbox_1'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

    bbox_2:
      target: 'http://localhost:5555/bbox_2'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

    node_to_bbox_1:
      target: 'http://localhost:5555/node/bbox-one'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

    node_to_bbox_2:
      target: 'http://localhost:5555/node/bbox-two'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"       

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Plain
      duration: 180
      arrivalRate: 100


scenarios:
  - name: Root (/)
    flow:
      - get:
          url: '/'